5.Resources/Hall_Implementation_openFOAM/Z3curvedanalytical/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (10 0 0)
    (10 1 0)
    (0 1 0)
    (0 0 0.1)
    (10 0 0.1)
    (10 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    cyclic1
    {
        type            cyclic;
		neighbourPatch  cyclic2;
        faces           ((3 7 6 2));
    }
    cyclic2
    {
        type            cyclic;
		neighbourPatch	cyclic1;
        faces           ((1 5 4 0));
    }

	frontAndBack
	{
		type 			empty;
		faces			((0 3 2 1)(4 5 6 7));
	}

    outlet
    {
        type            patch;
        faces           ((2 6 5 1));
    }
	
    inlet
    {
        type            patch;
        faces           ((0 4 7 3));
    }
	
);

mergePatchPairs
(
);

// ************************************************************************* //
