5.Resources/Hall_Implementation_openFOAM/Z3curvedanalytical/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform 0;
    }
	
    topWall
    {
        type            fixedValue;
        value           uniform 0;
    }
	
    sides1
    {
        type            cyclic;
    }
	
    sides2
    {
        type            cyclic;
    }

    outlet
    {
        type            fixedValue;
		value		    uniform 0;
	
    inlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
